app/controllers/pre_registration_controller.rb

INSERT INTO "pre_registrations" ("phone", "email", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["phone", "987567676"], ["email", "ashishsharma@mykaleidoscope.com"], ["created_at", "2018-09-06 12:18:03.578852"], ["updated_at", "2018-09-06 12:18:03.578852"], ["user_id", 2]]
---
	def create
  	    registration_record = PreRegistration.create(registration_params)